#include "Menu.h"

int menu;
int list1;
int list2;
int list3;
HOME home;
HOTEL hotel;
void MenuAdmin()//меню админа
{
	
	bool exit = false;
	while (!exit)//пока не выход, не выходить
	{
/////////////////////////////////////////////////////////////////////////Главная часть меню/////////////////////////////////////////////////////////////// 
		system("cls");
		cout << "................................................." << endl;
		cout << "1. Постройка недвижимости отеля" << endl;
		cout << "2. Редактирование недвижимости отеля" << endl;
		cout << "3. Снесение недвижимости отеля" << endl;
		cout << "4. Предпросмотр недвижимости отеля" << endl;
		cout << "5. Сохранение базы в файл" << endl;
		cout << "6. Считывание базы с файла" << endl;
		cout << "7. Выход" << endl;
		cout << "................................................." << endl;
		cin >> menu;

		switch (menu)
		{
//////////////////////////////////////////////////////////////Добавление\удаление\редактирование комнат////////////////////////////////////////////////////////// 
		case 1:
		{
			system("cls");
			home.Add();
			/////////////////////////////////
			bool a = false;
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
		}
		case 2:
		{
			system("cls");
			home.edit();
			/////////////////////////////////
			bool a = false;
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
		}
		case 3:
		{
			system("cls");
			home.Del();
			bool a = false;
			/////////////////////////////////
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
		}
/////////////////////////////////////////////////////////////////////Просмотр недвижимости/////////////////////////////////////////////////////////////////
		case 4:
		{
			system("cls");
			hotel.printAdress();
			hotel.printName();
			cout << "Структура отеля:" << endl;
			home.printVector();
			/////////////////////////////////
			bool a = false;
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
		}
/////////////////////////////////////////////////////////////////////////Запись в файл//////////////////////////////////////////////////////////////// 
		case 5:
		{
			home.writeVec();
			/////////////////////////////////
			bool a = false;
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
			break;
		}
/////////////////////////////////////////////////////////////////////////Считывание с файла//////////////////////////////////////////////////////////////// 
		case 6:
		{
			home.readFile();
			/////////////////////////////////
			bool a = false;
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
		}
///////////////////////////////////////////////////////////////////////////////Выход/////////////////////////////////////////////////////////////////
		case 7:
		{
			exit = true;
			break;
		}
		default:
			cout << "Такого пункта не существует!" << endl;
			Sleep(2000);//задержка экрана на 3 секунды
			system("cls");
			break;
		}
	}
}
void MenuGyest()//меню клиента
{
	bool exit = false;
	while (!exit)
	{
		system("cls");
		cout << "................................................." << endl;
		cout << "Мы приветствуем вас в нашем гостиничном комплексе \n\t\t'Орхидея'" << endl;
		cout << "................................................." << endl;
		cout << "Выберите пункт из списка:" << endl;
		cout << "1. Просмотр недвижимости отеля" << endl;
		cout << "2. Выход" << endl;
		cout << "................................................." << endl;
		cin >> list2;

		switch (list2)
		{
		case 1:
		{
			bool a = false;
			system("cls");
			hotel.printAdress();
			hotel.printName();
			cout << "\nСтруктура отеля:" << endl;
			home.printVector();
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
		}
		case 2:
		{
			exit = true;
			break;
		}
		default:
			cout << "Такого пункта не существует!" << endl;
			Sleep(2000);
			system("cls");
			break;
		}
	}
}