#include "Menu.h"

int menu;
int list1;
int list2;
int list3;

void MenuAdmin()//меню админа
{
	HOTEL hotel;
	HOME home;
	bool exit = false;
	while (!exit)//пока не выход, не выходить
	{
/////////////////////////////////////////////////////////////////////////Главная часть меню/////////////////////////////////////////////////////////////// 
		system("cls");
		cout << "................................................." << endl;
		cout << "1. Постройка недвижимости отеля" << endl;
		cout << "2. Предпросмотр недвижимости отеля" << endl;
		cout << "3. Сохранение объектов в файл" << endl;
		cout << "4. Считывание объектов из файла" << endl;
		cout << "5. Выход" << endl;
		cout << "................................................." << endl;
		cin >> menu;

		switch (menu)
		{
//////////////////////////////////////////////////////////////Добавление\удаление\редактирование комнат////////////////////////////////////////////////////////// 
		case 1:
		{
			system("cls");
			home.AddRooms();
			bool a = false;
			/////////////////////////////////
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
		}
/////////////////////////////////////////////////////////////////////Просмотр недвижимости/////////////////////////////////////////////////////////////////
		case 2:
		{
			system("cls");
			hotel.printAdress();
			hotel.printName();
			cout << "Структура отеля:" << endl;
			home.printVector();
			/////////////////////////////////
			bool e = false;
			cout << "Введите 0 для выхода: ";
			cin >> e;
			e = true;
			if (e == true)
			{
				break;
			}
		}
/////////////////////////////////////////////////////////////////////////Запись в файл//////////////////////////////////////////////////////////////// 
		case 3:
		{
			hotel.writeHotel();
			break;
		}
/////////////////////////////////////////////////////////////////////////Считывание с файла//////////////////////////////////////////////////////////////// 
		case 4:
		{

			break;
		}
///////////////////////////////////////////////////////////////////////////////Выход/////////////////////////////////////////////////////////////////
		case 5:
		{
			exit = true;
			break;
		}
		default:
			cout << "Такого пункта не существует!" << endl;
			Sleep(2000);//задержка экрана на 3 секунды
			system("cls");
			break;
		}
	}
}
void MenuGyest()//меню клиента
{
	HOTEL hotel;
	HOME home;
	bool exit = false;
	while (!exit)
	{
		system("cls");
		cout << "................................................." << endl;
		cout << "Мы приветствуем вас в нашем гостиничном комплексе \n\t\t'Орхидея'" << endl;
		cout << "................................................." << endl;
		cout << "Выберите пункт из списка:" << endl;
		cout << "1. Просмотр недвижимости отеля" << endl;
		cout << "2. Выход" << endl;
		cout << "................................................." << endl;
		cin >> list2;

		switch (list2)
		{
		case 1:
		{
			bool a = false;
			system("cls");
			hotel.printAdress();
			hotel.printName();
			cout << "Структура отеля:" << endl;
			home.printVector();
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}
		}
		case 2:
		{
			exit = true;
			break;
		}
		default:
			cout << "Такого пункта не существует!" << endl;
			Sleep(2000);
			system("cls");
			break;
		}
	}
}