#include "pch.h"
#include "Menu.h"
#include "Classes.h"
#include "vector.h"


int menu;
int menu2;
string login="art";
string password="123";
string loginVvod;
string passwordVvod;
int list1;
int list2;
int list3;
int list4;
HOME ad;
HOTEL nam;
APPARTMENT house;

void Menu()
{
	bool exit = false;
	while (!exit)
	{

		////////////////////////////////////////////////////////////////Главная часть меню/////////////////////////////////////////////////////////////// 

		system("cls");
		cout << "................................................." << endl;
		cout << "1. Вход под Админ" << endl;
		cout << "2. Вход под Гость" << endl;
		cout << "3. Выход" << endl;
		cout << "................................................." << endl;
		cin >> menu;

		switch (menu)
		{
		case 1:
			system("cls");
			cout << "................................................." << endl;
			cout << "Логин: ";
			cin >> loginVvod;

			if (login != loginVvod)
			{
				cout << "\nТакой администратор не зарегистрирован!" << endl;
				Sleep(3000);
				break;
			}
			else
			{
				cout << "Пароль: ";
				cin >> passwordVvod;
				cout << "\n................................................." << endl;
				if (password != passwordVvod)
				{
					cout << "Неверный пароль!" << endl;
					Sleep(3000);
					break;
				}
				else
				{
					system("cls");
					cout << "................................................." << endl;
					cout << "1. Постройка недвижимости гостиницы" << endl;
					cout << "2. Просмотр недвижимости гостиницы" << endl;
					cout << "3. Цветовая палитра" << endl;
					cout << "................................................." << endl;
					cin >> menu2;

					switch (menu2)
					{
					case 1:
						system("cls");
						cout << "................................................." << endl;
						cout << "1. Постройка/удаление/редактирование объектов" << endl;
						cout << "2. Сохранение объектов в файл" << endl;
						cout << "................................................." << endl;
						cin >> list1;

						/////////////////////////////////////////////////////////////Добавление\удаление комнат////////////////////////////////////////////////////////// 

						if (list1 == 1)
						{
							system("cls");
							cout << "................................................." << endl;
							cout << "1. Добавить комнату" << endl;
							cout << "2. Удалить комнату" << endl;
							cout << "3. Редактировать комнату" << endl;
							cout << "................................................." << endl;
							cin >> list4;
							/////////////////////////////////
							if (list4 == 1)
							{
								system("cls");
								house.SetAddAmountRooms();
								for (int i = 0; i < house.GetAddAmountRooms(); i++)
								{
									addRoom();
								}
							}
							/////////////////////////////////
							if (list4 == 2)
							{
								system("cls");
								house.SetDelAmountRooms();
								for (int i = 0; i < house.GetDelAmountRooms(); i++)
								{
									delRoom();
								}
							}
							/////////////////////////////////
							if (list4 == 3)
							{
								system("cls");
								edit();
							}
						}

						////////////////////////////////////////////////////////////////////Запись в файл//////////////////////////////////////////////////////////////// 

						bool a;
						if (list1 == 2)
						{
							ad.write1();
							nam.write2();
							writeVec();
							a = false;
						}
						/////////////////////////////////
						cout << "Введите 0 для выхода: ";
						cin >> a;
						a = true;
						if (a == true)
						{
							break;
						}

						/////////////////////////////////////////////////////////////////////Второй case///////////////////////////////////////////////////////////////// 

					case 2:
						bool f;

						system("cls");
						ad.printAdress();
						nam.printName();
						printVector();

						f = false;
						cout << "Введите 0 для выхода: ";
						cin >> f;
						f = true;
						if (f == true)
						{
							break;
						}

						/////////////////////////////////////////////////////////////////////Третий case///////////////////////////////////////////////////////////////// 

					case 3:
						system("cls");
						cout << "................................................." << endl;
						cout << "\nВыберите палитру из списка:\n" << endl;
						cout << "1. DEFAULT" << endl;
						cout << "2. Зелёный фон, красный текст" << endl;
						cout << "3. Чёрный фон, светло-зелёный текст" << endl;
						cout << "4. Лиловый фон, жёлтый текст" << endl;
						cout << "5. Голубой фон, лиловый текст\n" << endl;
						cout << "................................................." << endl;
						cin >> list2;
						/////////////////////////////////////////////////////////////////////Цветовая палитра//////////////////////////////////////////////////////////// 
						if (list2 == 1)
						{
							system("color 07");
						}
						if (list2 == 2)
						{
							system("color 24");
						}
						if (list2 == 3)
						{
							system("color 0A");
						}
						if (list2 == 4)
						{
							system("color 56");
						}
						if (list2 == 5)
						{
							system("color 35");
						}

						break;
					}
				}

		case 2:

			system("cls");
			cout << "................................................." << endl;
			cout << "Мы приветствуем вас в нашем гостиничном комплексе \n\t\t'Орхидея'" << endl;
			cout << "................................................." << endl;
			cout << "1. Считывание информации с файла для гостей" << endl;
			cin >> list3;

			if (list3 = 1)
			{

			}

			break;

		case 3:

			exit = true;
			break;

		default:
			cout << "Такого пункта не существует!" << endl;
			Sleep(3000);
			system("cls");
			break;
			}
		}
	}
}