#include "pch.h"
#include "Menu.h"

int menu;
int list1(0);
int list2(0);
int list3(0);
int list4(0);
HOME ad;
HOTEL nam;
APPARTMENT house;

void Menu()
{
	bool exit = false;
	while (!exit)
	{
////////////////////////////////////////////////////////////////Главная часть меню/////////////////////////////////////////////////////////////// 
		system("cls");
		cout << "................................................." << endl;
		cout << "Мы приветствуем вас в нашем гостиничном комплексе \n\t\t'Орхидея'" << endl;
		cout << "................................................." << endl;
		cout << "\nВыберите пункт из списка:\n" << endl;
		cout << "1. Постройка недвижимости гостиницы" << endl;
		cout << "2. Просмотр недвижимости гостиницы" << endl;
		cout << "3. Цветовая палитра" << endl;
		cout << "4. Выход\n" << endl;
		cin >> menu;

		switch (menu)
		{
/////////////////////////////////////////////////////////////////////Первый case///////////////////////////////////////////////////////////////// 
		case 1:
			system("cls");
			cout << "................................................." << endl;
			cout << "\nВыберите пункт из списка:\n" << endl;
			cout << "1. Постройка/удаление/редактирование объектов" << endl;
			cout << "2. Сохранение объектов в файл" << endl;
			cin >> list1;

/////////////////////////////////////////////////////////////Добавление\удаление комнат////////////////////////////////////////////////////////// 

			if (list1 == 1)
			{
				system("cls");
				cout << "................................................." << endl;
				cout << "\nВыберите пункт из списка:\n" << endl;
				cout << "1. Добавить комнату" << endl;
				cout << "2. Удалить комнату" << endl;
				cout << "3. Редактировать комнату" << endl;
				cin >> list4;

				if (list4 == 1)
				{
					system("cls");
					house.SetAddAmountRooms();
					for (int i = 0; i < house.GetAddAmountRooms(); i++)
					{
						addRoom();
					}
				}
				if (list4 == 2)
				{
					system("cls");
					house.SetDelAmountRooms();
					for (int i = 0; i < house.GetDelAmountRooms(); i++)
					{
						delRoom();
					}
				}
				if (list4 == 3)
				{
					system("cls");
					edit();
				}
			}
////////////////////////////////////////////////////////////////////Запись в файл//////////////////////////////////////////////////////////////// 
			if (list1 == 2)
			{
				/*ad.write1();
				nam.write2();
				house.write3();*/
			}
			bool a;
			a = false;
			cout << "Введите 0 для выхода: ";
			cin >> a;
			a = true;
			if (a == true)
			{
				break;
			}

/////////////////////////////////////////////////////////////////////Второй case///////////////////////////////////////////////////////////////// 
		case 2:
			system("cls");
			cout << "................................................." << endl;
			cout << "\nВыберите пункт из списка:\n" << endl;
			cout << "1. Просмотр объектов из файла" << endl;
			cin >> list2;
			bool e;
//////////////////////////////////////////////////////////////////Считывание с файла///////////////////////////////////////////////////////////// 
			if (list2 == 1)
			{
				system("cls");
				ad.printAddress();
				nam.printName();
				printVector();

				e = false;
			}
			cout << "Введите 0 для выхода: ";
			cin >> e;
			e = true;
			if (e == true)
			{
				break;
			}

/////////////////////////////////////////////////////////////////////Третий case///////////////////////////////////////////////////////////////// 
		case 3:
			system("cls");
			cout << "................................................." << endl;
			cout << "\nВыберите палитру из списка:\n" << endl;
			cout << "1. DEFAULT" << endl;
			cout << "2. Зелёный фон, красный текст" << endl;
			cout << "3. Чёрный фон, светло-зелёный текст" << endl;
			cout << "4. Лиловый фон, жёлтый текст" << endl;
			cout << "5. Голубой фон, лиловый текст" << endl;
			cin >> list3;
/////////////////////////////////////////////////////////////////////Цветовая палитра//////////////////////////////////////////////////////////// 
			if (list3 == 1)
			{
				system("color 07");
			}
			if (list3 == 2)
			{
				system("color 24");
			}
			if (list3 == 3)
			{
				system("color 0A");
			}
			if (list3 == 4)
			{
				system("color 56");
			}
			if (list3 == 5)
			{
				system("color 35");
			}

			break;

		case 4:

			exit = true;
			break;

		default:
			cout << "Такого пункта не существует!" << endl;
			break;
		}
	}
}

